rbarzic/elua/src/platform/sim3u1xx/platform.c
  int i;
  for( i=0; i<4; i++)
  {
	SI32_PBSTD_A_set_pins_analog(port_std[ i ], 0x0000);
	SI32_PBSTD_A_write_pbskipen(port_std[ i ], 0xFFFF);
    SI32_PBSTD_A_set_pins_digital_input( port_std[ i ], 0xFFFF);
    SI32_PBSTD_A_disable_pullup_resistors( port_std[ i ] );
    SI32_PBSTD_A_write_pins_low( port_std[ i ], 0xFFFF );
  }
  //Set I2C pins to analog float...
  SI32_PBSTD_A_set_pins_analog( SI32_PBSTD_0, 0x0000C000);
  SI32_PBSTD_A_write_pins_low( SI32_PBSTD_0, 0xC000 );


  SI32_PBHD_A_set_pins_push_pull_output( SI32_PBHD_4, 0x00 );
  SI32_PBHD_A_set_pins_low_drive_strength(SI32_PBHD_4, 0x3F);
  SI32_PBHD_A_disable_bias( SI32_PBHD_4 );
  SI32_PBHD_A_disable_pin_current_limit( SI32_PBHD_4, 0x3F );
  SI32_PBHD_A_set_pins_digital_input( SI32_PBHD_4, 0x3F );
  SI32_PBHD_A_disable_pullup_resistors( SI32_PBHD_4 );
  SI32_PBHD_A_write_pins_low( SI32_PBHD_4, 0x3F );

  //Set the disconnects mosfets to float!
  SI32_PBHD_A_set_pins_push_pull_output( SI32_PBHD_4, 0x04 );
  SI32_PBHD_A_write_pins_high( SI32_PBHD_4, 0x04 );
}


void sim3_pmu_pm9( unsigned seconds )
{
  //u8 i;

  if(external_power())
  {
    printf("Unit is powered, no PM9\n");
    rram_reg[0] = seconds;
    return;
  }

  // GET CURRENT TIMER VALUE INTO SETCAP
  //SI32_RTC_A_start_timer_capture(SI32_RTC_0);
  //while(SI32_RTC_A_is_timer_capture_in_progress(SI32_RTC_0));

  // SET ALARM FOR now+s
  // RTC running at 16.384Khz so there are 16384 cycles/sec)
  if( seconds > PIN_CHECK_INTERVAL )
  {
    rram_reg[0] = seconds - PIN_CHECK_INTERVAL;
    SI32_RTC_A_write_alarm0(SI32_RTC_0, /*SI32_RTC_A_read_setcap(SI32_RTC_0) +*/ (16384 * PIN_CHECK_INTERVAL));
  }
  else
  {
    rram_reg[0] = 0;
    SI32_RTC_A_write_alarm0(SI32_RTC_0, /*SI32_RTC_A_read_setcap(SI32_RTC_0) +*/ (16384 * seconds));
  }


  // Sleep if buttons pressed
  // Disable the SysTick timer to prevent these interrupts
  // from waking the core.
  SysTick->CTRL &= ~SysTick_CTRL_ENABLE_Msk;


  // Stop USB
  SI32_USB_A_reset_module( SI32_USB_0 );
  NVIC_DisableIRQ(USB0_IRQn);
  SI32_USB_A_disable_module(SI32_USB_0);
  SI32_USB_A_disable_internal_pull_up( SI32_USB_0 );

  // Enter Sleep Mode
  myPB_enter_off_config();
  VMON0_enter_power_9_mode_from_normal_power_mode();
  LDO0_enter_power_9_mode_from_normal_power_mode();
  VREG0_enter_power_9_mode_from_normal_power_mode();
  //PMU0_enter_power_9_mode_from_normal_power_mode();
  RSTSRC0_enter_power_9_mode_from_normal_power_mode();

  //Reset RTC Timer and clear any interrupts
  SI32_RTC_A_write_setcap(SI32_RTC_0, 0x0);
  SI32_RTC_A_start_timer_set(SI32_RTC_0);
  SI32_RTC_A_clear_alarm0_interrupt(SI32_RTC_0);
  SI32_RTC_A_clear_oscillator_fail_flag(SI32_RTC_0);
  while(SI32_RTC_A_is_timer_set_in_progress(SI32_RTC_0));

  //Enable reset off of RTC or Reset Pin
  SI32_PMU_A_write_wakeen(SI32_PMU_0, 0x0); //Clear all wake events
  SI32_PMU_A_enable_reset_pin_wake_event(SI32_PMU_0);
  SI32_PMU_A_enable_rtc0_alarm_wake_event(SI32_PMU_0);

  //Enable WAKE setup
  SI32_PMU_A_set_pin_wake_events( SI32_PMU_0, (1 << 10), (1 << 10) );
  SI32_RSTSRC_0->RESETEN_SET = SI32_RSTSRC_A_RESETEN_WAKEREN_MASK | 0x0000003; //replace incorrect SI32_PMU_A_enable_pin_wake_reset
  SI32_PMU_A_enable_pin_wake_event( SI32_PMU_0 );
  SI32_PMU_A_enable_pin_wake( SI32_PMU_0 );

  SI32_PMU_A_clear_wakeup_flags( SI32_PMU_0 );
  //>>HERE
  SI32_RTC_A_start_timer(SI32_RTC_0); //Start count down to wakeup
  myPMU_enter_sleep();




  // GET CURRENT TIMER VALUE INTO SETCAP
  //--SI32_RTC_A_start_timer_capture(SI32_RTC_0);
  //--while(SI32_RTC_A_is_timer_capture_in_progress(SI32_RTC_0));

  // SET ALARM FOR now+s
  // RTC running at 16.384Khz so there are 16384 cycles/sec)
  //--if( seconds > PIN_CHECK_INTERVAL )
  //--{
  //--  rram_reg[0] = seconds - PIN_CHECK_INTERVAL;
  //--  SI32_RTC_A_write_alarm0(SI32_RTC_0, SI32_RTC_A_read_setcap(SI32_RTC_0) + (16384 * PIN_CHECK_INTERVAL));
  //--}
  //--else
  //--{
  //--  rram_reg[0] = 0;
  //--  SI32_RTC_A_write_alarm0(SI32_RTC_0, SI32_RTC_A_read_setcap(SI32_RTC_0) + (16384 * seconds));
  //--}

  //--SI32_RTC_A_clear_alarm0_interrupt(SI32_RTC_0);

  // Stop USB
  //--SI32_USB_A_reset_module( SI32_USB_0 );
  //--NVIC_DisableIRQ(USB0_IRQn);
  //--SI32_USB_A_disable_module(SI32_USB_0);
  //--SI32_USB_A_disable_internal_pull_up( SI32_USB_0 );


  // Enable RTC alarm interrupt
  //SI32_RTC_A_enable_alarm0_interrupt(SI32_RTC_0);

  // Disable crossbar peripheral connections
  //SI32_PBCFG_A_write_xbar1(SI32_PBCFG_0,0x00000000);
  //SI32_PBCFG_A_write_xbar0h(SI32_PBCFG_0,0x00000000);
  //SI32_PBCFG_A_write_xbar0l(SI32_PBCFG_0,0x00000000);

  // Set pins as digital inputs, disable pullups and set pins low since
  // SI32_PBSTD_A_set_pins_digital_input sets latch high
  //--for( i=0; i<4; i++)
  //--{
  //--  SI32_PBSTD_A_set_pins_digital_input( port_std[ i ], 0xFFFF);
  //--  SI32_PBSTD_A_disable_pullup_resistors( port_std[ i ] );
  //--  SI32_PBSTD_A_write_pins_low( port_std[ i ], 0xFFFF );
  //--}

  // Attempt to minimize current on I2C pins by enabling pullups again on
  // PB0 & resetting pins as digital input (sets latch high)
  //--SI32_PBSTD_A_enable_pullup_resistors( port_std[ 0 ] );
  //--SI32_PBSTD_A_set_pins_digital_input( port_std[ 0 ], 0x6000);
  //SI32_PBSTD_A_enable_pullup_resistors( port_std[ 3 ] );

  // Prep PBHD for PM9 and set up as digital inputs as done with
  // PBSTD ports.
  //--SI32_PBHD_A_disable_bias( SI32_PBHD_4 );
  //--SI32_PBHD_A_disable_pin_current_limit( SI32_PBHD_4, 0x3F );
  //--SI32_PBHD_A_set_pins_digital_input( SI32_PBHD_4, 0x3F );
  //--SI32_PBHD_A_disable_pullup_resistors( SI32_PBHD_4 );
  //--SI32_PBHD_A_write_pins_low( SI32_PBHD_4, 0x3F );

  // Mask low priority interrupts from waking us
  //--__set_BASEPRI(0x40);

  // DISABLE all wakeup sources
  SI32_PMU_A_write_wakeen(SI32_PMU_0, 0x0);

  // ENABLE RTC_Alarm, RESET pin & Comparator 0 as wake events
  //SI32_PMU_A_enable_rtc0_alarm_wake_event( SI32_PMU_0 );
  //SI32_PMU_A_enable_reset_pin_wake_event( SI32_PMU_0 );
  //SI32_PMU_A_enable_comparator0_wake_event( SI32_PMU_0 );

  // Enable 3.6 (WAKE.10)
  //SI32_PMU_A_set_pin_wake_events( SI32_PMU_0, (1 << 10), (1 << 10) );
  //SI32_PMU_A_enable_pin_wake_event( SI32_PMU_0 );

